
&НаКлиенте
Процедура Команда1(Команда)
	КаталогПользователя = РабочийКаталогДанныхПользователя();
	
	КлючевоеСлово = "AppData";
	ПостояннаяСтрока = "AppData\Local\1C\1cv8";
	
	ПоложениеКлючевогоСлова = СтрНайти(КаталогПользователя, КлючевоеСлово);

	Если ПоложениеКлючевогоСлова = 0 Тогда
		ВызватьИсключение "Не удалось определить путь к кэш";	
	КонецЕсли;
	
	ПутьПоиска = Лев(КаталогПользователя, ПоложениеКлючевогоСлова - 1) + ПостояннаяСтрока;

	ОчиститьКеш(ПутьПоиска);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКеш(Знач ПутьПоиска)
	НайденныеКаталоги = НайтиФайлы(ПутьПоиска, "????????-????-????-????-????????????", Истина);
	
	ПутьПоиска = ПутьПоиска + "\";
	
	Для Каждого НайденныйКаталог Из НайденныеКаталоги Цикл
		ПолныйПуть = НайденныйКаталог.ПолноеИмя;

		ИмяКаталога = СтрЗаменить(ПолныйПуть, ПутьПоиска, "");
		Если ЭтоПодкаталог(ИмяКаталога) Тогда
			Продолжить;	
		КонецЕсли;

		ПутьУдаления = ПутьПоиска + ИмяКаталога;
		
		Попытка
			УдалитьФайлы(ПутьУдаления);
			
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось удалить каталог """ + ПутьУдаления + """.";
			Сообщение.Сообщить();	
					
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ЭтоПодкаталог(ИмяКаталога)
	Возврат СтрНайти(ИмяКаталога, "\") > 0;
КонецФункции
