
&НаКлиенте
Процедура Команда1(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СформироватьОтчетНаСервере()
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Привет мир!";
	Сообщение.Сообщить();
	

КонецПроцедуры // СформироватьОтчетНаСервере()
